Tekla.Structures.Drawing.AlongPartCenteredPlacingType
The AlongPartCenteredPlacingType class defines a placing type
that places the object using the along line placing.
The line used will be the part's edge in the center of that line.

Tekla.Structures.Drawing.AlongPartCenteredPlacingType.#ctor
Creates a new along part centered placing type instance.